; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 411608 2 1 2 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation6 - direction
	Star5 - direction
	GroundStation4 - direction
	Star1 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite1 Planet8)
	(have_image Planet7 thermograph0)
	(have_image Planet8 thermograph0)
	(have_image Star9 image1)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 image1)
	(have_image Star12 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 8
3. (turn_to satellite0 star1 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star1)
   goals met: 1 of 8
4. (turn_to satellite1 groundstation4 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
5. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 8
6. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 8
7. (turn_to satellite0 star9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star9)
   goals met: 0 of 8
8. (turn_to satellite1 star12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star12)
   goals met: 0 of 8
9. (take_image satellite1 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 1 of 8
10. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 2 of 8
11. (turn_to satellite1 planet8 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet8)
   goals met: 3 of 8
12. (turn_to satellite0 planet7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet7)
   goals met: 3 of 8
13. (take_image satellite1 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 4 of 8
14. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 5 of 8
15. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 6 of 8
16. (turn_to satellite1 planet11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet11)
   goals met: 5 of 8
17. (take_image satellite1 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 6 of 8
18. (turn_to satellite0 phenomenon10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 8
19. (turn_to satellite1 planet8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet8)
   goals met: 6 of 8
20. (take_image satellite0 phenomenon10 instrument0 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 7 of 8
21. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 8 of 8
